In [3]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [9]:
df

          W         X         Y         Z
A  1.229011 -1.471442 -1.824120 -0.399537
B  0.217687 -1.669841 -0.461624  2.350389
C  0.156016  2.542571 -1.138509  0.273977
D -0.502241  2.616217  0.877280 -0.780046
E  0.877183 -0.201501  2.361765  1.217063

In [11]:
df.drop('W',axis=1)

          X         Y         Z
A -1.471442 -1.824120 -0.399537
B -1.669841 -0.461624  2.350389
C  2.542571 -1.138509  0.273977
D  2.616217  0.877280 -0.780046
E -0.201501  2.361765  1.217063

In [12]:
df

          W         X         Y         Z
A  1.229011 -1.471442 -1.824120 -0.399537
B  0.217687 -1.669841 -0.461624  2.350389
C  0.156016  2.542571 -1.138509  0.273977
D -0.502241  2.616217  0.877280 -0.780046
E  0.877183 -0.201501  2.361765  1.217063

In [41]:
df.drop('W',axis=1,inplace=True)

In [42]:
df

          X         Y         Z
A  0.196800 -1.136645  0.000366
B -0.156598 -0.031579  0.649826
C -0.610259 -0.755325 -0.346419
D -0.479448  0.558769  1.024810
E  1.862864 -1.133817  0.610478

In [17]:
df

          W         X         Y         Z
A  1.229011 -1.471442 -1.824120 -0.399537
B  0.217687 -1.669841 -0.461624  2.350389
C  0.156016  2.542571 -1.138509  0.273977
D -0.502241  2.616217  0.877280 -0.780046
E  0.877183 -0.201501  2.361765  1.217063

In [15]:
df.loc['C']

W    0.156016
X    2.542571
Y   -1.138509
Z    0.273977
Name: C, dtype: float64

In [14]:
df.iloc[2]

W    0.156016
X    2.542571
Y   -1.138509
Z    0.273977
Name: C, dtype: float64

In [18]:
df.loc['B','X']

-1.6698408970197989

In [19]:
df.drop('A')

          W         X         Y         Z
B  0.217687 -1.669841 -0.461624  2.350389
C  0.156016  2.542571 -1.138509  0.273977
D -0.502241  2.616217  0.877280 -0.780046
E  0.877183 -0.201501  2.361765  1.217063

In [20]:
df

          W         X         Y         Z
A  1.229011 -1.471442 -1.824120 -0.399537
B  0.217687 -1.669841 -0.461624  2.350389
C  0.156016  2.542571 -1.138509  0.273977
D -0.502241  2.616217  0.877280 -0.780046
E  0.877183 -0.201501  2.361765  1.217063

In [24]:
df.drop('W',axis=1)

          X         Y         Z
A -1.471442 -1.824120 -0.399537
B -1.669841 -0.461624  2.350389
C  2.542571 -1.138509  0.273977
D  2.616217  0.877280 -0.780046
E -0.201501  2.361765  1.217063

In [25]:
df

          W         X         Y         Z
A  1.229011 -1.471442 -1.824120 -0.399537
B  0.217687 -1.669841 -0.461624  2.350389
C  0.156016  2.542571 -1.138509  0.273977
D -0.502241  2.616217  0.877280 -0.780046
E  0.877183 -0.201501  2.361765  1.217063

In [26]:
df.drop('W',axis=1,inplace=True)

In [28]:
df

          X         Y         Z
A -1.471442 -1.824120 -0.399537
B -1.669841 -0.461624  2.350389
C  2.542571 -1.138509  0.273977
D  2.616217  0.877280 -0.780046
E -0.201501  2.361765  1.217063

In [4]:
df

          W         X         Y         Z
A  0.614596 -0.067301  1.022361 -2.211540
B -1.823919 -0.420541  0.757938 -1.737318
C -0.765852  1.073436  0.237442 -1.463310
D  0.735810  1.194056  0.443293  0.715906
E -0.189272 -0.204822 -0.222298 -0.722003

In [5]:
df.iloc[2]

W   -0.765852
X    1.073436
Y    0.237442
Z   -1.463310
Name: C, dtype: float64

In [6]:
df['W']

A    0.614596
B   -1.823919
C   -0.765852
D    0.735810
E   -0.189272
Name: W, dtype: float64

In [8]:
df.loc[['A','C'],['W','Z']]

          W        Z
A  0.614596 -2.21154
C -0.765852 -1.46331

In [9]:
df

          W         X         Y         Z
A  0.614596 -0.067301  1.022361 -2.211540
B -1.823919 -0.420541  0.757938 -1.737318
C -0.765852  1.073436  0.237442 -1.463310
D  0.735810  1.194056  0.443293  0.715906
E -0.189272 -0.204822 -0.222298 -0.722003

In [10]:
df[df>0]

          W         X         Y         Z
A  0.614596       NaN  1.022361       NaN
B       NaN       NaN  0.757938       NaN
C       NaN  1.073436  0.237442       NaN
D  0.735810  1.194056  0.443293  0.715906
E       NaN       NaN       NaN       NaN

In [14]:
df[df['W']>0] #conditional Selection

          W         X         Y         Z
A  0.614596 -0.067301  1.022361 -2.211540
D  0.735810  1.194056  0.443293  0.715906

In [15]:
df[df['W']>0][['X','Y']]

          X         Y
A -0.067301  1.022361
D  1.194056  0.443293

In [30]:
boolser=df['W']>0
result=df[boolser]
my_cols=['X','Y']

In [33]:
result[my_cols]

          X         Y
A -0.067301  1.022361
D  1.194056  0.443293

In [37]:
df[(df['W']>0) & (df['Y']>1)] #and , or operations in pandas are forbidded 
                              #because they calculate single boolean values at a time in python use & and | for bool data

          W         X         Y        Z
A  0.614596 -0.067301  1.022361 -2.21154

In [38]:
newind='CA OR NY SR WE'.split()

In [40]:
newind

['CA', 'OR', 'NY', 'SR', 'WE']

In [41]:
df['states']=newind

In [42]:
df

          W         X         Y         Z states
A  0.614596 -0.067301  1.022361 -2.211540     CA
B -1.823919 -0.420541  0.757938 -1.737318     OR
C -0.765852  1.073436  0.237442 -1.463310     NY
D  0.735810  1.194056  0.443293  0.715906     SR
E -0.189272 -0.204822 -0.222298 -0.722003     WE

In [43]:
df.set_index('states',inplace=True)

In [44]:
df

               W         X         Y         Z
states
CA      0.614596 -0.067301  1.022361 -2.211540
OR     -1.823919 -0.420541  0.757938 -1.737318
NY     -0.765852  1.073436  0.237442 -1.463310
SR      0.735810  1.194056  0.443293  0.715906
WE     -0.189272 -0.204822 -0.222298 -0.722003

In [6]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [12]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [13]:
df

             A         B
G1 1 -1.629908 -1.128135
   2  0.623007 -0.127213
   3 -0.127642 -0.669615
G2 1 -0.547840 -0.317015
   2  0.036278  0.162947
   3  0.068780 -0.956265

In [15]:
df.index.names=['Groups','Number']

In [16]:
df

                      A         B
Groups Number
G1     1      -1.629908 -1.128135
       2       0.623007 -0.127213
       3      -0.127642 -0.669615
G2     1      -0.547840 -0.317015
       2       0.036278  0.162947
       3       0.068780 -0.956265

In [18]:
df.loc['G1'].loc[2]['B']

-0.1272131993536674

In [21]:
df.xs(1,level='Number')

               A         B
Groups
G1     -1.629908 -1.128135
G2     -0.547840 -0.317015

In [2]:
d={'A':[11,2,np.nan],'B':[2,np.nan,np.nan],'C':[4,7,1]}

In [3]:
df=pd.DataFrame(d)

In [4]:
df

      A    B  C
0  11.0  2.0  4
1   2.0  NaN  7
2   NaN  NaN  1

In [6]:
df.dropna(thresh=2)

      A    B  C
0  11.0  2.0  4
1   2.0  NaN  7

In [8]:
df.dropna(axis=1,inplace=True,thresh=1)

In [9]:
df

      A    B  C
0  11.0  2.0  4
1   2.0  NaN  7
2   NaN  NaN  1

In [12]:
df.dropna(axis=1,thresh=2)

      A  C
0  11.0  4
1   2.0  7
2   NaN  1

In [16]:
df.fillna(value='NAIam')

       A      B  C
0     11      2  4
1      2  NAIam  7
2  NAIam  NAIam  1

In [17]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [18]:
df=pd.DataFrame(data)

In [19]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [23]:
byComp=df.groupby('Company')

In [24]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [25]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [31]:
pd.merge(left,right,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [35]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])